In [2]:
import mysql.connector as sql
import pandas as pd

mydb = sql.connect (
    host = "localhost",
    user = "root",
    password = "ZAQs8271911c$",
    auth_plugin='mysql_native_password',
    database = "sql_intro"
)
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x7fa4fa03d490>

# commends that works in mysql workbench not pandas framework
```
# show all the databases
show databaes; -- mysql
select * from sys.databases -- sql server

# use database
use database_name

```

# describe table
## showing data types of each columns

In [27]:
# edit sql query here

sql_query = """
#! get details of a table
describe employees;
"""
#! for sql server exec sp_columns table_name



# run sql queries and Importing data from a MySQL database 
# into Pandas data frame
df = pd.read_sql_query(
    sql_query,
    mydb)
df.head()

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

      Field            Type Null           Key Default Extra
0  Emp_name  b'varchar(25)'  YES            []    None
1    Emp_ID          b'int'   NO  [80, 82, 73]    None
2       Age          b'int'  YES            []    None
3    gender      b'char(1)'  YES            []    None
4       Doj         b'date'  YES            []    None

# create database
# if exists

#### only execute the sql query not passing to pandas dataframe

In [3]:
mycoursor = mydb.cursor()

mycoursor.execute(
    """
    #! create database
    create database if not exists database_name;
    """
)

# drop database
# if not exists

In [29]:
mycoursor = mydb.cursor()
mycoursor.execute(
    """
    #! drop database
    drop database if exists database_name;

    """
)

# create table if not exists

In [30]:
mycoursor = mydb.cursor()
mycoursor.execute(
"""
create table if not exists table_name(
    name varchar(25),
    Age int,
    sex char(1),
    doj date,
    city varchar(15),
    salary float
);
"""
)

# drop table if exists

In [31]:
mycoursor = mydb.cursor()
mycoursor.execute(
"""
drop table if exists table_name;
"""
)

```
-- !SQL Server大致上有char varchar nchar nvarchar text ntext 這6種可以選擇。
-- 不過較常用的4種char varchar nchar nvarchar的資料型態。
-- <point> 仔細觀察以上4種型態從字面上的差別只在有無var以及有無n
		-- ?var
        -- * 定長(沒有var):文字的長度固定
             -- 當輸入的數據長度沒有達到指定的長度時將自動以英文空格在其後面填充，讓長度達到相對應的長度。
		-- * 變長(有var):表示是實際存儲空間是變長的
			 -- 也就是說當輸入的數據長度沒有達到指定的長度時不會在後面填充空格。
             -- (不過text所存儲的也是可變長的)。
		/* example
        rocket1 char(10)
		rocket2 varchar(10)
		存入相同的資料「HiIU」
		rocket1 會自動在「HiIU」後面補空白，存滿10 Bytes。
		rocket2 會根據資料長度變更儲存空間，「HiIU」共四個英文字符，所以則存了4 Bytes。
        !使用varchar相對節省空間。
        */
        
        -- ?n 
        -- refers to unicode or non-unicode
        -- 在資料庫中，每個英文字符的儲存空間只需要一個 1 Byte，
        -- 但若是非英文字及符號，如中文、泰文、日文、韓文等非英文字符，則需要 2 Byte來儲存。
		-- 如果英文與中文同時存在，由於占用空間數不同，容易造成混亂，導致讀取出來的字符串是亂碼。
        -- 所以就要使用Unicode字符集(N)。

        -- * Unicode(有n):所有的文字都用2 Byte來儲存，
        -- 即使是英文字也是使用2 Byte來儲存，
        -- 就可以解決中英文字符集不兼容的問題。
        -- * 非Unicode(沒有n):文字是英文字符就是1 Byte;
        -- * 非英文字符就是使用2 Byte來儲存。
        -- ! 較佔儲存空間，但若儲存的資料不限於英文，
        -- ! 建議都以n開頭的欄位型態為主，避免亂碼。

-- summay
-- 有var的:在存不固定長度的資料時，較省空間。
-- 有n的:支援Unicode，不過儲存的資料會大兩倍(全部都英文字的話啦)。
/*
char 存資料有固定長度，並且都為英文數字。
nchar 存資料有固定長度，但不確定是否都是英文數字。
varchar 存資料沒有固定長度，並且都為英文數字。
nvarchar 存資料沒有固定長度，且不確定是否皆為英文數字。
*/

```

# these wont work on juypter
# show all users
```
select * from mysql.user;
```
#

```
SELECT user,authentication_string,plugin,host FROM mysql.user;
select user, authentication_string, plugin from mysql.user;
```
### plugin代表密碼方式有:auth_socket和mysql_native_password
### 接著把root的auth_socket換成mysql_native_password

## change password
```
ALTER USER 'root'@'localhost' IDENTIFIED WITH mysql_native_password BY 'password';
```
## after changing password need to restart and take effect
```
FLUSH PRIVILEGES;
```
## 倒著順序查看user表格的欄位:
```
desc user;
```

# insert data into table

In [32]:
# mycoursor = mydb.cursor()
# mycoursor.execute(
# """
# INSERT INTO emp_details
# VALUES ("Jimmy", 35, "M", "2005-05-30", "Chicago", 70000),
# 	            ("Shane", 30, "M", "1999-06-25", "Seattle", 55000),
#                 ("Marry", 28, "F", "2009-03-10", "Boston", 62000),
#                 ("Dwayne", 37, "M", "2011-07-12", "Austin", 57000),
# 	            ("Sara", 32, "F", "2017-10-27", "New York", 72000),
# 	            ("Ammy", 35, "F", "2014-12-20", "Seattle", 80000);
# """
# )

# insert values vs  insert value
#### its just readability issue only, all works the same

# get data from table
#### select column

In [33]:

# edit sql query here
#! insert data into table
sql_query = """
select * 
from emp_details;  
"""
# select * > * means all
# select * = get all columns
# from table_name



# run sql queries and Importing data from a MySQL database 
# into Pandas data frame
df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     Name  Age sex         doj      city   salary
0   Jimmy   35   M  2005-05-30   Chicago  70000.0
1   Shane   30   M  1999-06-25   Seattle  55000.0
2   Marry   28   F  2009-03-10    Boston  62000.0
3  Dwayne   37   M  2011-07-12    Austin  57000.0
4    Sara   32   F  2017-10-27  New York  72000.0
5    Ammy   35   F  2014-12-20   Seattle  80000.0

# select distinct
# get data from column but no duplicate

In [34]:
# edit sql query here
#! get the data from employees 
sql_query = """
SELECT  * 
from employees;  
"""

# run sql queries and Importing data from a MySQL database 
# into Pandas data frame
df = pd.read_sql_query(
    sql_query,
    mydb)
df.head()  # just get first five datas

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  Emp_name  Emp_ID  Age gender         Doj       Dept         City    Salary
0  Matthew   10000   30      M  2000-10-17  Marketing      Chicago   40000.0
1    Betty   10001   39      M  2000-08-06         PR  Los Angeles  100000.0
2    Nancy   10002   43      M  2000-03-04         PR      Chicago   50000.0
3   Daniel   10003   19      M  2000-09-19    Finance  San Antonio   70000.0
4     Lisa   10004   42      F  2000-03-17         IT      Phoenix   60000.0

In [35]:
# edit sql query here
#! lets use DISTINCT to show Citys with no duplicate from table employees
sql_query = """
SELECT  DISTINCT City
from employees;  
"""

# run sql queries and Importing data from a MySQL database 
# into Pandas data frame
df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           City
0       Chicago
1   Los Angeles
2   San Antonio
3       Phoenix
4       Houston
5      San Jose
6        Dallas
7  Philadelphia
8     San Diego

In [36]:
# edit sql query here
# get data from emp_details table for brief idea
#! in sql workbench capital sensitivity is not matters, but in here does maters
sql_query = """
select * from emp_details;
"""

# run sql queries and Importing data from a MySQL database 
# into Pandas data frame
df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     Name  Age sex         doj      city   salary
0   Jimmy   35   M  2005-05-30   Chicago  70000.0
1   Shane   30   M  1999-06-25   Seattle  55000.0
2   Marry   28   F  2009-03-10    Boston  62000.0
3  Dwayne   37   M  2011-07-12    Austin  57000.0
4    Sara   32   F  2017-10-27  New York  72000.0
5    Ammy   35   F  2014-12-20   Seattle  80000.0

In [37]:
# edit sql query here
# get data from emp_details table for brief idea

sql_query = """
select distinct city 
from emp_details;
"""
# select distinct city 
#? gets values from column "City" but no duplicate 

# run sql queries and Importing data from a MySQL database 
# into Pandas data frame
df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

       city
0   Chicago
1   Seattle
2    Boston
3    Austin
4  New York

#### then you would notice Seattle is no longer duplicated

# delete a data from table
```
delete from table_name
where name = "Robbin";
```

In [38]:
# insert a employee named Robbin then delete it
mycoursor = mydb.cursor()
mycoursor.execute(
"""
insert into emp_details
value ("Robbin", 35, "F", "2005-05-30", "Chicago", 70000);
"""
)

In [39]:
# edit sql query here
# insert a value first then delete it
sql_query = """
select *
from emp_details;
"""
# run sql queries and Importing data from a MySQL database 
# into Pandas data frame
df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     Name  Age sex         doj      city   salary
0   Jimmy   35   M  2005-05-30   Chicago  70000.0
1   Shane   30   M  1999-06-25   Seattle  55000.0
2   Marry   28   F  2009-03-10    Boston  62000.0
3  Dwayne   37   M  2011-07-12    Austin  57000.0
4    Sara   32   F  2017-10-27  New York  72000.0
5    Ammy   35   F  2014-12-20   Seattle  80000.0
6  Robbin   35   F  2005-05-30   Chicago  70000.0

In [40]:
# lets delete Robbin
mycoursor = mydb.cursor()
mycoursor.execute(
"""
delete from emp_details
where name = "Robbin";
"""
)

In [41]:
# edit sql query here
# insert a value first then delete it
sql_query = """
select *
from emp_details;
"""
# run sql queries and Importing data from a MySQL database 
# into Pandas data frame
df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     Name  Age sex         doj      city   salary
0   Jimmy   35   M  2005-05-30   Chicago  70000.0
1   Shane   30   M  1999-06-25   Seattle  55000.0
2   Marry   28   F  2009-03-10    Boston  62000.0
3  Dwayne   37   M  2011-07-12    Austin  57000.0
4    Sara   32   F  2017-10-27  New York  72000.0
5    Ammy   35   F  2014-12-20   Seattle  80000.0

# count()
##### exp. counting how many employees in the database

In [42]:
# edit sql query here

sql_query = """
select count(name)
from emp_details;
"""
# run sql queries and Importing data from a MySQL database 
# into Pandas data frame
df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count(name)
0            6

# AS

In [43]:
# edit sql query here
# insert a value first then delete it
sql_query = """
select count(name) AS no_of_emp
from emp_details;
"""
# giving alias name for the column of the search result, 
# to rename count(name) column name into no_of_emp

# run sql queries and Importing data from a MySQL database 
# into Pandas data frame
df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   no_of_emp
0          6

# sum()

In [44]:

sql_query = """
select sum(salary)
from emp_details;
"""
df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   sum(salary)
0     396000.0

# avg()

In [45]:
sql_query = """
select avg(salary) 
from emp_details;
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   avg(salary)
0      66000.0

# select columns

In [46]:
# only wanna show columns Name, doj, salary
sql_query = """
select Name, doj, salary
from emp_details;
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     Name         doj   salary
0   Jimmy  2005-05-30  70000.0
1   Shane  1999-06-25  55000.0
2   Marry  2009-03-10  62000.0
3  Dwayne  2011-07-12  57000.0
4    Sara  2017-10-27  72000.0
5    Ammy  2014-12-20  80000.0